{
  "to": "liamsheridanlfc@gmail.com",
  "realProspect": "Fareed Aziz",
  "subject": "Great speaking with you - Fareed Aziz",
  "body": "Hi Fareed,\n\nGreat connecting today! Thanks for taking the time to walk through your current outbound setup and goals.\n\n**Quick Recap:**\n• Discussed your current lead generation challenges\n• Reviewed our multi-channel approach (Email → LinkedIn → Calling)\n• Covered our TAM coverage model (reaching every decision-maker every 45-60 days)\n\n**Next Steps:**\n• I'll send over a proposal outlining how we'd approach your specific market\n• We can schedule a follow-up call once you've had a chance to review\n\n**Recording:**\nHere's the link to our conversation for your reference: https://fathom.video/calls/543681319\n\nLooking forward to working together!\n\nBest,\nLiam\n\n---\nLiam Sheridan\nLeads That Show\nleadsthat.show",
  "callUrl": "https://fathom.video/calls/543681319",
  "duration": 30,
  "transcript": "Liam Sheridan: Fareed, how are you?\nLiam Sheridan: Good, how about you, Liam?\nFareed Aziz: Yeah, very well.\nLiam Sheridan: Where are you calling from today?\nFareed Aziz: I'm in West Virginia, how about you?\nLiam Sheridan: In where, sorry?\nLiam Sheridan: West Virginia.\nFareed Aziz: Oh, okay, nice.\nLiam Sheridan: Nice.\nLiam Sheridan: What's the time for you then?\nLiam Sheridan: Let me guess, right?\nLiam Sheridan: I'm going to say you're somewhere between, it's not 11, I think you're in the middle, I'm going to say 9 or 10.\nLiam Sheridan: 10.\nLiam Sheridan: It's 11.30.\nFareed Aziz: Damn.\nLiam Sheridan: So as you can probably tell, I'm not from the States, so I never have any idea what time it is for you guys.\nLiam Sheridan: I have to kind of guess between the two, Eastern and Western, but it's a little fun game, I like to play at the start of call, breaks the ice a little bit.\nLiam Sheridan: So, yeah.\nLiam Sheridan: Yeah, look, Fareed, I'm going to dive straight into things with us here.\nLiam Sheridan: We've only got 30 minutes, I'm going to make the most of our time.\nLiam Sheridan: So I run leads that show we are a B2B outbound agency.\nLiam Sheridan: We work with B2B companies, we book them appointments, as simple as that, right?\nLiam Sheridan: So I think there's potential.\nLiam Sheridan: I there's\nLiam Sheridan: for us to work together and for it to be a good fit.\nLiam Sheridan: And yeah, I just want to explore that on the call.\nLiam Sheridan: What you guys do in a little bit more detail.\nLiam Sheridan: I assume it's BPL from looking at the website and doing a little bit of research.\nLiam Sheridan: I just want to dive into a little bit around kind of what you're looking to get out of the call.\nLiam Sheridan: And then we can dive into the company a little bit more and what you're looking to achieve.\nFareed Aziz: Sure.\nFareed Aziz: Sounds good.\nFareed Aziz: How long have you been in business, Liam?\nLiam Sheridan: About a year now.\nLiam Sheridan: Okay.\nFareed Aziz: Okay.\nFareed Aziz: So what made you book the call?\nLiam Sheridan: I'm sorry?\nFareed Aziz: What made you book the call?\nLiam Sheridan: Oh, yeah.\nFareed Aziz: So I was intrigued by, I think, the email that I received that you guarantee about 20 calls that you could book leads that are qualified leads.\nFareed Aziz: So I was interested to learn more.\nFareed Aziz: And I'm actually in a process.\nFareed Aziz: I have been interviewing some marketing firms.\nFareed Aziz: And I was actually making it.\nFareed Aziz: Going to make a decision this week, then yours showed up.\nFareed Aziz: said, okay, let's one last call before I make that determination.\nFareed Aziz: So I thought the timing was right.\nFareed Aziz: And I thought, let me learn more.\nFareed Aziz: And then next week or next week, couple of weeks, we'll make a determination of what route we want to take.\nLiam Sheridan: That makes sense.\nLiam Sheridan: Okay, cool.\nLiam Sheridan: In terms then of how your other interviews have gone interested in, how have they been?\nLiam Sheridan: Are they like similar agencies doing a similar thing?\nFareed Aziz: Larger agencies have been in business for longer.\nFareed Aziz: Okay.\nFareed Aziz: Yeah.\nFareed Aziz: Makes sense.\nLiam Sheridan: Okay, tell me a little bit about the business because I'll be honest with you.\nLiam Sheridan: I've worked with a couple of BPO people in terms of staffing and things like that.\nLiam Sheridan: Mixed results, depending on the industry.\nLiam Sheridan: The general ones, just to be honest, I get less results for the specialist ones.\nLiam Sheridan: I have just taken on a new.\nLiam Sheridan: Client that's in the medical space, pretty similar to you guys.\nLiam Sheridan: Could even be a competitor, to be honest with you.\nLiam Sheridan: So interested to hear around kind of what makes you guys different and your kind of specialty in terms of that staff outsourcing.\nFareed Aziz: Sounds good.\nFareed Aziz: Did you hear that sound?\nFareed Aziz: Or is it just...\nFareed Aziz: No, no, I didn't hear anything.\nLiam Sheridan: Perfect.\nFareed Aziz: All right.\nFareed Aziz: I'm getting a call, so...\nFareed Aziz: Okay.\nFareed Aziz: Do you need to take it?\nFareed Aziz: Uh, no, since we have a scheduled time, we'll be on this call and I'll take that later on.\nFareed Aziz: So, yeah, so we are into healthcare staffing, predominantly back-end revenue cycle, basically end-to-end revenue cycle.\nFareed Aziz: So we help our organizations, whether it's a medical group or a large healthcare system, we help them with, you know, onboarding, qualified, experienced staff offshore.\nFareed Aziz: That helps them reduce the costs and also addresses the staffing concerns that we have been...\nFareed Aziz: This Take Okay.\nFareed Aziz: Experiencing in the healthcare industry in the U.S.\nFareed Aziz: We also do end-to-end revenue cycles.\nFareed Aziz: instead of staffing, if someone wants us to manage the whole end-to-end revenue cycle process, we hire our own leadership and we help them"
}